In [1]:
import pandas as pd 
import glob 
import os

In [4]:
glob.glob('../aux_data/*edu*')

['../aux_data/edu_ind.csv',
 '../aux_data/edu_hh.dta',
 '../aux_data/edu_ind.dta',
 '../aux_data/edu_hh.csv']

In [6]:
hh_edu = pd.read_csv('../aux_data/edu_hh.csv')

In [8]:
ind_edu = pd.read_csv('../aux_data/edu_ind.csv', dtype = {'m_ids': "object"})

In [10]:
trx = pd.read_csv('../diaries_transactions_all.csv', low_memory = False)

In [11]:
keep_ids_list = list(trx.m_ids_owner.unique())

In [12]:
hh_edu.head()

,hh_ids,edu_hh_child613inschool,edu_hh_child1417inschool,edu_hh_girls613inschool,edu_hh_girls1417inschool,edu_hh_boys613inschool,edu_hh_boys1417inschool,edu_hh_headattain_yrs
0,KELDK01,1.0,NaN,1.0,NaN,NaN,NaN,8.0
1,KELDK02,NaN,1.0,NaN,1.0,NaN,NaN,8.0
2,KELDK08,0.0,NaN,NaN,NaN,0.0,NaN,5.0
3,KELDK09,1.0,NaN,1.0,NaN,NaN,NaN,10.0
4,KELDK10,NaN,NaN,NaN,NaN,NaN,NaN,10.0

In [13]:
hh_edu.columns

Index(['hh_ids', 'edu_hh_child613inschool', 'edu_hh_child1417inschool',
       'edu_hh_girls613inschool', 'edu_hh_girls1417inschool',
       'edu_hh_boys613inschool', 'edu_hh_boys1417inschool',
       'edu_hh_headattain_yrs'],
      dtype='object')

In [14]:
hh_edu.shape

(298, 8)

In [15]:
ind_edu.columns

Index(['m_ids', 'hh_ids', 'edu_i_enrolled', 'edu_i_attain',
       'edu_i_attain_yrs'],
      dtype='object')

In [16]:
ind_edu.shape

(1565, 5)

In [17]:
len(ind_edu.m_ids.unique())

1565

In [18]:
ind_edu_sub = ind_edu.loc[ind_edu['m_ids'].isin(keep_ids_list)]

In [19]:
ind_edu_sub.shape

(669, 5)

In [20]:
edu_hh_ind_merge = ind_edu_sub.merge(hh_edu, 'left', ['hh_ids'])

In [21]:
edu_hh_ind_merge.shape

(669, 12)

In [22]:
edu_hh_ind_merge.head()

,m_ids,hh_ids,edu_i_enrolled,edu_i_attain,edu_i_attain_yrs,edu_hh_child613inschool,edu_hh_child1417inschool,edu_hh_girls613inschool,edu_hh_girls1417inschool,edu_hh_boys613inschool,edu_hh_boys1417inschool,edu_hh_headattain_yrs
0,56134390476100000,KELDK01,0.0,Primary (some or complete),8.0,1.0,NaN,1.0,NaN,NaN,NaN,8.0
1,56134390654900000,KELDK01,0.0,Secondary (some or complete),10.0,1.0,NaN,1.0,NaN,NaN,NaN,8.0
2,56134389503000000,KELDK02,0.0,Primary (some or complete),8.0,NaN,1.0,NaN,1.0,NaN,NaN,8.0
3,56134410699600000,KELDK08,0.0,Primary (some or complete),5.0,0.0,NaN,NaN,NaN,0.0,NaN,5.0
4,56134410709700000,KELDK08,0.0,Primary (some or complete),8.0,0.0,NaN,NaN,NaN,0.0,NaN,5.0

In [23]:
edu_hh_ind_merge.columns = ['m_ids', 'hh_ids', 'edu_i_enrolled', 'edu_i_attain', 'edu_i_attain_yrs',
       'edu_hh_child613inschool', 'edu_hh_child1417inschool',
       'edu_hh_girls613inschool', 'edu_hh_girls1417inschool',
       'edu_hh_boys613inschool', 'edu_hh_boys1417inschool',
       'edu_hh_headattain_yrs']

In [27]:
edu_hh_ind_merge.describe()

,edu_i_enrolled,edu_i_attain_yrs,edu_hh_child613inschool,edu_hh_child1417inschool,edu_hh_girls613inschool,edu_hh_girls1417inschool,edu_hh_boys613inschool,edu_hh_boys1417inschool,edu_hh_headattain_yrs
count,666.000000,648.000000,482.000000,361.000000,317.000000,240.000000,341.000000,189.000000,656.000000
mean,0.166667,7.663580,0.868845,0.942752,0.854364,0.930556,0.852151,0.957672,8.045732
std,0.372958,3.808934,0.271275,0.212533,0.313625,0.242587,0.321595,0.201871,3.434141
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,6.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,6.000000
50%,0.000000,8.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,8.000000
75%,0.000000,11.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,11.250000
max,1.000000,15.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,15.000000

In [34]:
for col in list(edu_hh_ind_merge.columns)[2:]: 
    print(col)
    print(edu_hh_ind_merge[col].value_counts())

edu_i_enrolled
0.0    555
1.0    111
Name: edu_i_enrolled, dtype: int64
edu_i_attain
Primary (some or complete)           349
Secondary (some or complete)         197
Post-secondary (some or complete)     43
No education                          41
Nursery/ Kindergarten                 24
Name: edu_i_attain, dtype: int64
edu_i_attain_yrs
8.0     160
12.0    108
0.0      63
7.0      62
10.0     47
13.0     40
6.0      29
5.0      29
4.0      25
11.0     24
2.0      20
3.0      19
9.0      17
1.0       3
15.0      2
Name: edu_i_attain_yrs, dtype: int64
edu_hh_child613inschool
1.000000    363
0.666667     59
0.000000     32
0.500000     17
0.750000      9
0.600000      2
Name: edu_hh_child613inschool, dtype: int64
edu_hh_child1417inschool
1.000000    333
0.000000     14
0.666667      6
0.333333      4
0.500000      4
Name: edu_hh_child1417inschool, dtype: int64
edu_hh_girls613inschool
1.000000    253
0.000000     30
0.500000     29
0.666667      5
Name: edu_hh_girls613inschool, dtype: int64
edu_hh_girls1417inschool
1.000000    220
0.000000     14
0.500000      4
0.666667      2
Name: edu_hh_girls1417inschool, dtype: int64
edu_hh_boys613inschool
1.000000    269
0.000000     37
0.500000     17
0.750000     13
0.666667      5
Name: edu_hh_boys613inschool, dtype: int64
edu_hh_boys1417inschool
1.0    181
0.0      8
Name: edu_hh_boys1417inschool, dtype: int64
edu_hh_headattain_yrs
8.0     144
12.0    131
7.0      79
10.0     52
4.0      50
6.0      34
0.0      31
13.0     30
5.0      26
11.0     25
9.0      17
3.0      17
2.0      16
15.0      3
1.0       1
Name: edu_hh_headattain_yrs, dtype: int64

In [20]:
# os.makedirs('data_ind', exist_ok = True)

In [21]:
edu_hh_ind_merge.to_csv('edu_hh_ind_merge.csv')